ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32660/Libraries/PeriphDrivers/Source/SPIMSS/spimss_reva_regs.h
 #define MXC_F_SPIMSS_REVA_CTRL_CLKPOL_POS                   3 /**< CTRL_CLKPOL Position */
 #define MXC_F_SPIMSS_REVA_CTRL_CLKPOL                       ((uint32_t)(0x1UL << MXC_F_SPIMSS_REVA_CTRL_CLKPOL_POS)) /**< CTRL_CLKPOL Mask */
 #define MXC_V_SPIMSS_REVA_CTRL_CLKPOL_IDLELO                ((uint32_t)0x0UL) /**< CTRL_CLKPOL_IDLELO Value */
 #define MXC_S_SPIMSS_REVA_CTRL_CLKPOL_IDLELO                (MXC_V_SPIMSS_REVA_CTRL_CLKPOL_IDLELO << MXC_F_SPIMSS_REVA_CTRL_CLKPOL_POS) /**< CTRL_CLKPOL_IDLELO Setting */
 #define MXC_V_SPIMSS_REVA_CTRL_CLKPOL_IDLEHI                ((uint32_t)0x1UL) /**< CTRL_CLKPOL_IDLEHI Value */
 #define MXC_S_SPIMSS_REVA_CTRL_CLKPOL_IDLEHI                (MXC_V_SPIMSS_REVA_CTRL_CLKPOL_IDLEHI << MXC_F_SPIMSS_REVA_CTRL_CLKPOL_POS) /**< CTRL_CLKPOL_IDLEHI Setting */

 #define MXC_F_SPIMSS_REVA_CTRL_PHASE_POS                    4 /**< CTRL_PHASE Position */
 #define MXC_F_SPIMSS_REVA_CTRL_PHASE                        ((uint32_t)(0x1UL << MXC_F_SPIMSS_REVA_CTRL_PHASE_POS)) /**< CTRL_PHASE Mask */
 #define MXC_V_SPIMSS_REVA_CTRL_PHASE_ACTIVEEDGE             ((uint32_t)0x0UL) /**< CTRL_PHASE_ACTIVEEDGE Value */
 #define MXC_S_SPIMSS_REVA_CTRL_PHASE_ACTIVEEDGE             (MXC_V_SPIMSS_REVA_CTRL_PHASE_ACTIVEEDGE << MXC_F_SPIMSS_REVA_CTRL_PHASE_POS) /**< CTRL_PHASE_ACTIVEEDGE Setting */
 #define MXC_V_SPIMSS_REVA_CTRL_PHASE_INACTIVEEDGE           ((uint32_t)0x1UL) /**< CTRL_PHASE_INACTIVEEDGE Value */
 #define MXC_S_SPIMSS_REVA_CTRL_PHASE_INACTIVEEDGE           (MXC_V_SPIMSS_REVA_CTRL_PHASE_INACTIVEEDGE << MXC_F_SPIMSS_REVA_CTRL_PHASE_POS) /**< CTRL_PHASE_INACTIVEEDGE Setting */

 #define MXC_F_SPIMSS_REVA_CTRL_BIRQ_POS                     5 /**< CTRL_BIRQ Position */
 #define MXC_F_SPIMSS_REVA_CTRL_BIRQ                         ((uint32_t)(0x1UL << MXC_F_SPIMSS_REVA_CTRL_BIRQ_POS)) /**< CTRL_BIRQ Mask */
 #define MXC_V_SPIMSS_REVA_CTRL_BIRQ_DISABLE                 ((uint32_t)0x0UL) /**< CTRL_BIRQ_DISABLE Value */
 #define MXC_S_SPIMSS_REVA_CTRL_BIRQ_DISABLE                 (MXC_V_SPIMSS_REVA_CTRL_BIRQ_DISABLE << MXC_F_SPIMSS_REVA_CTRL_BIRQ_POS) /**< CTRL_BIRQ_DISABLE Setting */
 #define MXC_V_SPIMSS_REVA_CTRL_BIRQ_ENABLE                  ((uint32_t)0x1UL) /**< CTRL_BIRQ_ENABLE Value */
 #define MXC_S_SPIMSS_REVA_CTRL_BIRQ_ENABLE                  (MXC_V_SPIMSS_REVA_CTRL_BIRQ_ENABLE << MXC_F_SPIMSS_REVA_CTRL_BIRQ_POS) /**< CTRL_BIRQ_ENABLE Setting */

 #define MXC_F_SPIMSS_REVA_CTRL_STR_POS                      6 /**< CTRL_STR Position */
 #define MXC_F_SPIMSS_REVA_CTRL_STR                          ((uint32_t)(0x1UL << MXC_F_SPIMSS_REVA_CTRL_STR_POS)) /**< CTRL_STR Mask */
 #define MXC_V_SPIMSS_REVA_CTRL_STR_COMPLETE                 ((uint32_t)0x0UL) /**< CTRL_STR_COMPLETE Value */
 #define MXC_S_SPIMSS_REVA_CTRL_STR_COMPLETE                 (MXC_V_SPIMSS_REVA_CTRL_STR_COMPLETE << MXC_F_SPIMSS_REVA_CTRL_STR_POS) /**< CTRL_STR_COMPLETE Setting */
 #define MXC_V_SPIMSS_REVA_CTRL_STR_START                    ((uint32_t)0x1UL) /**< CTRL_STR_START Value */
 #define MXC_S_SPIMSS_REVA_CTRL_STR_START                    (MXC_V_SPIMSS_REVA_CTRL_STR_START << MXC_F_SPIMSS_REVA_CTRL_STR_POS) /**< CTRL_STR_START Setting */

 #define MXC_F_SPIMSS_REVA_CTRL_IRQE_POS                     7 /**< CTRL_IRQE Position */
 #define MXC_F_SPIMSS_REVA_CTRL_IRQE                         ((uint32_t)(0x1UL << MXC_F_SPIMSS_REVA_CTRL_IRQE_POS)) /**< CTRL_IRQE Mask */
 #define MXC_V_SPIMSS_REVA_CTRL_IRQE_DISABLE                 ((uint32_t)0x0UL) /**< CTRL_IRQE_DISABLE Value */
 #define MXC_S_SPIMSS_REVA_CTRL_IRQE_DISABLE                 (MXC_V_SPIMSS_REVA_CTRL_IRQE_DISABLE << MXC_F_SPIMSS_REVA_CTRL_IRQE_POS) /**< CTRL_IRQE_DISABLE Setting */
 #define MXC_V_SPIMSS_REVA_CTRL_IRQE_ENABLE                  ((uint32_t)0x1UL) /**< CTRL_IRQE_ENABLE Value */
 #define MXC_S_SPIMSS_REVA_CTRL_IRQE_ENABLE                  (MXC_V_SPIMSS_REVA_CTRL_IRQE_ENABLE << MXC_F_SPIMSS_REVA_CTRL_IRQE_POS) /**< CTRL_IRQE_ENABLE Setting */

/**@} end of group SPIMSS_CTRL_Register */

/**
 * @ingroup  spimss_registers
 * @defgroup SPIMSS_INT_FL SPIMSS_INT_FL
 * @brief    SPI Interrupt Flag Register.
 * @{
 */
 #define MXC_F_SPIMSS_REVA_INT_FL_SLAS_POS                   0 /**< INT_FL_SLAS Position */
 #define MXC_F_SPIMSS_REVA_INT_FL_SLAS                       ((uint32_t)(0x1UL << MXC_F_SPIMSS_REVA_INT_FL_SLAS_POS)) /**< INT_FL_SLAS Mask */
 #define MXC_V_SPIMSS_REVA_INT_FL_SLAS_SELECTED              ((uint32_t)0x0UL) /**< INT_FL_SLAS_SELECTED Value */
 #define MXC_S_SPIMSS_REVA_INT_FL_SLAS_SELECTED              (MXC_V_SPIMSS_REVA_INT_FL_SLAS_SELECTED << MXC_F_SPIMSS_REVA_INT_FL_SLAS_POS) /**< INT_FL_SLAS_SELECTED Setting */
 #define MXC_V_SPIMSS_REVA_INT_FL_SLAS_NOTSELECTED           ((uint32_t)0x1UL) /**< INT_FL_SLAS_NOTSELECTED Value */
 #define MXC_S_SPIMSS_REVA_INT_FL_SLAS_NOTSELECTED           (MXC_V_SPIMSS_REVA_INT_FL_SLAS_NOTSELECTED << MXC_F_SPIMSS_REVA_INT_FL_SLAS_POS) /**< INT_FL_SLAS_NOTSELECTED Setting */

 #define MXC_F_SPIMSS_REVA_INT_FL_TXST_POS                   1 /**< INT_FL_TXST Position */
 #define MXC_F_SPIMSS_REVA_INT_FL_TXST                       ((uint32_t)(0x1UL << MXC_F_SPIMSS_REVA_INT_FL_TXST_POS)) /**< INT_FL_TXST Mask */
 #define MXC_V_SPIMSS_REVA_INT_FL_TXST_IDLE                  ((uint32_t)0x0UL) /**< INT_FL_TXST_IDLE Value */
 #define MXC_S_SPIMSS_REVA_INT_FL_TXST_IDLE                  (MXC_V_SPIMSS_REVA_INT_FL_TXST_IDLE << MXC_F_SPIMSS_REVA_INT_FL_TXST_POS) /**< INT_FL_TXST_IDLE Setting */
 #define MXC_V_SPIMSS_REVA_INT_FL_TXST_BUSY                  ((uint32_t)0x1UL) /**< INT_FL_TXST_BUSY Value */
 #define MXC_S_SPIMSS_REVA_INT_FL_TXST_BUSY                  (MXC_V_SPIMSS_REVA_INT_FL_TXST_BUSY << MXC_F_SPIMSS_REVA_INT_FL_TXST_POS) /**< INT_FL_TXST_BUSY Setting */

 #define MXC_F_SPIMSS_REVA_INT_FL_TUND_POS                   2 /**< INT_FL_TUND Position */
 #define MXC_F_SPIMSS_REVA_INT_FL_TUND                       ((uint32_t)(0x1UL << MXC_F_SPIMSS_REVA_INT_FL_TUND_POS)) /**< INT_FL_TUND Mask */
 #define MXC_V_SPIMSS_REVA_INT_FL_TUND_NOEVENT               ((uint32_t)0x0UL) /**< INT_FL_TUND_NOEVENT Value */
 #define MXC_S_SPIMSS_REVA_INT_FL_TUND_NOEVENT               (MXC_V_SPIMSS_REVA_INT_FL_TUND_NOEVENT << MXC_F_SPIMSS_REVA_INT_FL_TUND_POS) /**< INT_FL_TUND_NOEVENT Setting */
 #define MXC_V_SPIMSS_REVA_INT_FL_TUND_OCCURRED              ((uint32_t)0x1UL) /**< INT_FL_TUND_OCCURRED Value */
 #define MXC_S_SPIMSS_REVA_INT_FL_TUND_OCCURRED              (MXC_V_SPIMSS_REVA_INT_FL_TUND_OCCURRED << MXC_F_SPIMSS_REVA_INT_FL_TUND_POS) /**< INT_FL_TUND_OCCURRED Setting */

 #define MXC_F_SPIMSS_REVA_INT_FL_ROVR_POS                   3 /**< INT_FL_ROVR Position */
 #define MXC_F_SPIMSS_REVA_INT_FL_ROVR                       ((uint32_t)(0x1UL << MXC_F_SPIMSS_REVA_INT_FL_ROVR_POS)) /**< INT_FL_ROVR Mask */
 #define MXC_V_SPIMSS_REVA_INT_FL_ROVR_NOEVENT               ((uint32_t)0x0UL) /**< INT_FL_ROVR_NOEVENT Value */
 #define MXC_S_SPIMSS_REVA_INT_FL_ROVR_NOEVENT               (MXC_V_SPIMSS_REVA_INT_FL_ROVR_NOEVENT << MXC_F_SPIMSS_REVA_INT_FL_ROVR_POS) /**< INT_FL_ROVR_NOEVENT Setting */
 #define MXC_V_SPIMSS_REVA_INT_FL_ROVR_OCCURRED              ((uint32_t)0x1UL) /**< INT_FL_ROVR_OCCURRED Value */
 #define MXC_S_SPIMSS_REVA_INT_FL_ROVR_OCCURRED              (MXC_V_SPIMSS_REVA_INT_FL_ROVR_OCCURRED << MXC_F_SPIMSS_REVA_INT_FL_ROVR_POS) /**< INT_FL_ROVR_OCCURRED Setting */

 #define MXC_F_SPIMSS_REVA_INT_FL_ABT_POS                    4 /**< INT_FL_ABT Position */
 #define MXC_F_SPIMSS_REVA_INT_FL_ABT                        ((uint32_t)(0x1UL << MXC_F_SPIMSS_REVA_INT_FL_ABT_POS)) /**< INT_FL_ABT Mask */
 #define MXC_V_SPIMSS_REVA_INT_FL_ABT_NOEVENT                ((uint32_t)0x0UL) /**< INT_FL_ABT_NOEVENT Value */
 #define MXC_S_SPIMSS_REVA_INT_FL_ABT_NOEVENT                (MXC_V_SPIMSS_REVA_INT_FL_ABT_NOEVENT << MXC_F_SPIMSS_REVA_INT_FL_ABT_POS) /**< INT_FL_ABT_NOEVENT Setting */
 #define MXC_V_SPIMSS_REVA_INT_FL_ABT_OCCURRED               ((uint32_t)0x1UL) /**< INT_FL_ABT_OCCURRED Value */
 #define MXC_S_SPIMSS_REVA_INT_FL_ABT_OCCURRED               (MXC_V_SPIMSS_REVA_INT_FL_ABT_OCCURRED << MXC_F_SPIMSS_REVA_INT_FL_ABT_POS) /**< INT_FL_ABT_OCCURRED Setting */

 #define MXC_F_SPIMSS_REVA_INT_FL_COL_POS                    5 /**< INT_FL_COL Position */
 #define MXC_F_SPIMSS_REVA_INT_FL_COL                        ((uint32_t)(0x1UL << MXC_F_SPIMSS_REVA_INT_FL_COL_POS)) /**< INT_FL_COL Mask */
 #define MXC_V_SPIMSS_REVA_INT_FL_COL_NOEVENT                ((uint32_t)0x0UL) /**< INT_FL_COL_NOEVENT Value */
 #define MXC_S_SPIMSS_REVA_INT_FL_COL_NOEVENT                (MXC_V_SPIMSS_REVA_INT_FL_COL_NOEVENT << MXC_F_SPIMSS_REVA_INT_FL_COL_POS) /**< INT_FL_COL_NOEVENT Setting */
 #define MXC_V_SPIMSS_REVA_INT_FL_COL_OCCURRED               ((uint32_t)0x1UL) /**< INT_FL_COL_OCCURRED Value */
 #define MXC_S_SPIMSS_REVA_INT_FL_COL_OCCURRED               (MXC_V_SPIMSS_REVA_INT_FL_COL_OCCURRED << MXC_F_SPIMSS_REVA_INT_FL_COL_POS) /**< INT_FL_COL_OCCURRED Setting */

 #define MXC_F_SPIMSS_REVA_INT_FL_TOVR_POS                   6 /**< INT_FL_TOVR Position */
 #define MXC_F_SPIMSS_REVA_INT_FL_TOVR                       ((uint32_t)(0x1UL << MXC_F_SPIMSS_REVA_INT_FL_TOVR_POS)) /**< INT_FL_TOVR Mask */
 #define MXC_V_SPIMSS_REVA_INT_FL_TOVR_NOEVENT               ((uint32_t)0x0UL) /**< INT_FL_TOVR_NOEVENT Value */
 #define MXC_S_SPIMSS_REVA_INT_FL_TOVR_NOEVENT               (MXC_V_SPIMSS_REVA_INT_FL_TOVR_NOEVENT << MXC_F_SPIMSS_REVA_INT_FL_TOVR_POS) /**< INT_FL_TOVR_NOEVENT Setting */
 #define MXC_V_SPIMSS_REVA_INT_FL_TOVR_OCCURRED              ((uint32_t)0x1UL) /**< INT_FL_TOVR_OCCURRED Value */
 #define MXC_S_SPIMSS_REVA_INT_FL_TOVR_OCCURRED              (MXC_V_SPIMSS_REVA_INT_FL_TOVR_OCCURRED << MXC_F_SPIMSS_REVA_INT_FL_TOVR_POS) /**< INT_FL_TOVR_OCCURRED Setting */

